InformationRegisters/СопоставлениеАдресации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеАдресации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункционалВТекущейИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункционалВТекущейИБ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИсполнительОбращений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>125</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДПользователя</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>45</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступВыдан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>добавитьВПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СопоставлениеАдресации/Ext/ManagerModule.bsl
Функция получитьДанныеПользователяИПодписантов() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = текстЗапросаДанныеПользователя();
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь.Ссылка);
		
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции

функция текстЗапросаДанныеПользователя()
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПолучательПервичногоДокумента.Пользователь КАК ПолучательФИО,
			|	ПолучательПервичногоДокумента.Должность КАК ПолучательДолжность,
			|	ПолучательПервичногоДокумента.Подразделение КАК ПолучательПодразделение
			|ИЗ
			|	РегистрСведений.СопоставлениеАдресации КАК ПолучательПервичногоДокумента
			|ГДЕ
			|ПолучательПервичногоДокумента.Пользователь В (Выбрать  Константы.ПолучательПервичногоДокумента.Ссылка ИЗ Константы КАК Константы)
			|////////////////////////////////////////////////////////////////////////////////
		  |;
		  |ВЫБРАТЬ
	        |	СопоставлениеАдресации.Пользователь КАК ЗаявительФИО,
	        |	СопоставлениеАдресации.Должность КАК ЗаявительДолжность,
	        |	СопоставлениеАдресации.Подразделение КАК ЗаявительПодразделение,
		  |	СопоставлениеАдресации.Пользователь.Организация КАК Организация,
		  |    СопоставлениеАдресации.Пользователь.Телефон КАК ЗаявительТелефон,
		  |    СопоставлениеАдресации.Пользователь.АдресЭлектроннойПочты КАК ЗаявительПочта
	        |ИЗ
	        |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	        |ГДЕ
	        |	СопоставлениеАдресации.Пользователь = &ТекущийПользователь";
	
КонецФункции

функция текстЗапросаДанныеПользователяПоЕгоСсылке()
	
	Возврат "ВЫБРАТЬ ПЕРВЫЕ 1
	        |	СопоставлениеАдресации.Пользователь КАК ФИО,
	        |	СопоставлениеАдресации.Должность КАК Должность,
	        |	СопоставлениеАдресации.Подразделение КАК Подразделение
	        |ИЗ
	        |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	        |ГДЕ
	        |	СопоставлениеАдресации.Пользователь.ПолноеИмя = &полноеИмяПользователя"
	
КонецФункции

Функция получитьДанныеПользователяПоЕгоСсылке(полноеИмяПользователя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = текстЗапросаДанныеПользователяПоЕгоСсылке();
	Запрос.УстановитьПараметр("полноеИмяПользователя", полноеИмяПользователя);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		данныеПользователя = Новый Структура("ФИО,Должность,Подразделение", Выборка.ФИО, Выборка.Должность,Выборка.Подразделение);
	Иначе
		данныеПользователя = Новый Структура("ФИО,Должность,Подразделение",
												Справочники.Пользователи.ПустаяСсылка(),
												Справочники.Должности.ПустаяСсылка(),
												Справочники.Подразделения.ПустаяСсылка());
	КонецЕсли;
	
	Возврат данныеПользователя;
	
КонецФункции

Функция получитьФункцииПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	СопоставлениеАдресации.ФункционалВТекущейИБ КАК ФункционалВТекущейИБ
	               |ИЗ
	               |	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	               |ГДЕ
	               |	СопоставлениеАдресации.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		данныеПользователя = Новый Структура("ФункционалВТекущейИБ", Выборка.ФункционалВТекущейИБ);
	Иначе
		данныеПользователя = Новый Структура("ФункционалВТекущейИБ", Справочники.ФункционалВТекущейИБ.ПустаяСсылка());
	КонецЕсли;
	
	Возврат данныеПользователя;
	
КонецФункции

Функция ПолучитьПодписантаИТ()	Экспорт
	парам = Новый Массив;
	парам.Добавить(Новый Структура("имя,знч", "ФункционалВТекущейИБ", Справочники.ФункционалВТекущейИБ.РуководительИсполнителей) );
	Запрос = ПолучитьЗапрос( текстЗапросаПолучитьПользователяПоЕгоФункциям(), парам );
	Выборка = Запрос.Выполнить().Выбрать();	
	Возврат ?( Выборка.Следующий(), Выборка.Ссылка, Справочники.Пользователи.ПустаяСсылка() );
КонецФункции

Функция ПолучитьЗапрос(текстЗапроса, параметрыЗапросаМассивСтруктур) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = текстЗапроса;
	Для Каждого парам Из параметрыЗапросаМассивСтруктур Цикл
		Запрос.УстановитьПараметр(парам.Имя, парам.Знч);
	КонецЦикла;
	
	Возврат Запрос;
КонецФункции

Функция текстЗапросаПолучитьПользователяПоЕгоФункциям()
	Возврат 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СопоставлениеАдресации.Пользователь.Ссылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.СопоставлениеАдресации КАК СопоставлениеАдресации
	|ГДЕ
	|	СопоставлениеАдресации.ФункционалВТекущейИБ = &ФункционалВТекущейИБ";
КонецФункции
